In [1]:
import pandas as pd
import numpy as np

In [2]:
my_series = pd.Series(data = [1,2,3],index = ['A','B','C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
print(f"Accessing first element using my_series[0]: {my_series[0]}")
print(f"Accessing first element using my_series['A']: {my_series['A']}")
#test other index
print(f"Accessing first element using my_series['1']: {my_series[1]}")
print(f"Accessing first element using my_series['B']: {my_series['B']}")

Accessing first element using my_series[0]: 1
Accessing first element using my_series['A']: 1
Accessing first element using my_series['1']: 2
Accessing first element using my_series['B']: 2

In [4]:
my_series_dic = pd.Series(data = {'A':1,'B':2,'C':3})
print(my_series_dic)
print(type(my_series_dic))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [5]:
my_series_numpy = pd.Series(data = np.array([1,2,3]), index = ['A','B','C'])
print(my_series_numpy)
print(type(my_series_numpy))

A    1
B    2
C    3
dtype: int32
<class 'pandas.core.series.Series'>

In [6]:
my_series_unlabled = pd.Series(pd.Series(data = [10,20,30]))
print(my_series_unlabled)
print(type(my_series_unlabled))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
week_one = pd.Series(data = [100,50,300], index = ['Bob','Sally','Jess'])
week_one

Bob      100
Sally     50
Jess     300
dtype: int64

In [8]:
week_two = pd.Series(data = [500,30,20], index = ['Bob','Sally','Jess'])
week_two

Bob      500
Sally     30
Jess      20
dtype: int64

In [9]:
total_due = week_one + week_two
total_due

Bob      600
Sally     80
Jess     320
dtype: int64

In [10]:
#multiply total due
multiply_total_due = total_due*total_due
multiply_total_due

Bob      360000
Sally      6400
Jess     102400
dtype: int64

In [11]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ['A','B','C','D'],
                    columns = ["col1","col2","col3","col4","col5"])
print(my_df)
print(type(my_df))

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
<class 'pandas.core.frame.DataFrame'>

In [12]:
print(my_df["col2"])
print(type(my_df))

A     1
B     6
C    11
D    16
Name: col2, dtype: int32
<class 'pandas.core.frame.DataFrame'>

In [13]:
my_df_unlabled = pd.DataFrame(data = np.arange(0,20).reshape(4,5), columns = ["col1","col2","col3","col4","col5"])
print(my_df_unlabled)
#test 2 unlabled rows and columns
my_df_unlabled_2=pd.DataFrame(data = np.arange(0,20).reshape(4,5))
print(my_df_unlabled_2)

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     5     6     7     8     9
2    10    11    12    13    14
3    15    16    17    18    19
    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [14]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ["A","B","C","D"],
                    columns = ["col1", "col2", "col3", "col4", "col5"])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [15]:
my_df["col2"]

A     1
B     6
C    11
D    16
Name: col2, dtype: int32

In [16]:
my_df[["col2","col3"]]

   col2  col3
A     1     2
B     6     7
C    11    12
D    16    17

In [17]:
my_df.iloc[0]

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int32

In [18]:
my_df.loc["A"]

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int32

In [19]:
my_df.iloc[0:3]

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [20]:
my_df.loc["A":"C"]

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [21]:
my_df.iloc[1:4,0:3]

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [22]:
my_df.loc["B":"D","col1":"col3"]

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [23]:
my_df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), index = ["A","B","C","D"],
                    columns = ["col1","col2","col3","col4", "col5"])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [24]:
my_df % 2 == 0

    col1   col2   col3   col4   col5
A   True  False   True  False   True
B  False   True  False   True  False
C   True  False   True  False   True
D  False   True  False   True  False

In [25]:
#test 2 odd are true
my_df % 2 == 1

    col1   col2   col3   col4   col5
A  False   True  False   True  False
B   True  False   True  False   True
C  False   True  False   True  False
D   True  False   True  False   True

In [26]:
my_df[my_df % 2 == 0]

   col1  col2  col3  col4  col5
A   0.0   NaN   2.0   NaN   4.0
B   NaN   6.0   NaN   8.0   NaN
C  10.0   NaN  12.0   NaN  14.0
D   NaN  16.0   NaN  18.0   NaN

In [27]:
my_df[my_df % 2 == 0].fillna(value = 0)

   col1  col2  col3  col4  col5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0

In [28]:
my_df[my_df % 2 == 0].fillna(value = my_df["col2"].mean())

   col1  col2  col3  col4  col5
A   0.0   8.5   2.0   8.5   4.0
B   8.5   6.0   8.5   8.0   8.5
C  10.0   8.5  12.0   8.5  14.0
D   8.5  16.0   8.5  18.0   8.5

In [29]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [30]:
my_df["newCol"] = [10,20,30,40]
my_df

   col1  col2  col3  col4  col5  newCol
A     0     1     2     3     4      10
B     5     6     7     8     9      20
C    10    11    12    13    14      30
D    15    16    17    18    19      40

In [31]:
my_df["col1+col2"] = my_df["col1"] + my_df["col2"]
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2
A     0     1     2     3     4      10          1
B     5     6     7     8     9      20         11
C    10    11    12    13    14      30         21
D    15    16    17    18    19      40         31

In [32]:
my_df.drop(columns = ["newCol"])

   col1  col2  col3  col4  col5  col1+col2
A     0     1     2     3     4          1
B     5     6     7     8     9         11
C    10    11    12    13    14         21
D    15    16    17    18    19         31

In [33]:
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2
A     0     1     2     3     4      10          1
B     5     6     7     8     9      20         11
C    10    11    12    13    14      30         21
D    15    16    17    18    19      40         31

In [34]:
my_df.drop(columns = ["newCol","col1+col2"], inplace = True)

In [35]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [36]:
my_df = pd.DataFrame({'Type':["Falcon","Falcon", "Parrot","Parrot","Cat","Cat","Cat"],
                     'Max Speed' : [380.,370., 24., 26., 50., 50., 150.,]})
my_df

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

In [37]:
print(f"unique types: {my_df['Type'].unique()}")
print(f"unique max speeds: {my_df['Max Speed'].unique()}")

unique types: ['Falcon' 'Parrot' 'Cat']
unique max speeds: [380. 370.  24.  26.  50. 150.]

In [38]:
my_df['Type'].value_counts()

Cat       3
Falcon    2
Parrot    2
Name: Type, dtype: int64

In [39]:
print(f"sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"mean of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"min of Max Speed col: {my_df['Max Speed'].min()}")
print(f"max of Max Speed col: {my_df['Max Speed'].max()}")

sum of Max Speed col: 1050.0
mean of Max Speed col: 150.0
min of Max Speed col: 24.0
max of Max Speed col: 380.0

In [40]:
my_df.groupby(by = 'Type').mean()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000